---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCExtrusionCalculatorUtils Methods
IFCExtrusionCalculatorUtils Class See Also Send Feedback
---

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<(Of <<'(Face>)>>)) |  |

# See Also

IFCExtrusionCalculatorUtils Class

Autodesk.Revit.DB.IFC Namespace